---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
MEPAnalyticalModelData Properties
MEPAnalyticalModelData Class See Also Send Feedback
---

The MEPAnalyticalModelData type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

MEPAnalyticalModelData Class

Autodesk.Revit.DB.Analysis Namespace